{
    "2.0.387": {
        "1": "Determined necessary dependencies, greatly speeding up execution of any single program",
        "2": "Rewrote msn2 library to incorporate new, safer syntax, this includes many tests",
        "3": "Implemented 'argument picker' for def() defined functions, allowing for more flexible argument passing"
    },
    "2.0.388": {
        "1": "Added '!' specifier for object methods, this specifier forces the method to be destructive regardless of the prior value of the variable calling the method.",
        "2": "Added partial type enforcements, this has only been applied to the existing MSN2 package functions. User functions may come in the future.",
        "3": "Enabled the MSN2 interpreter to interpret multi-lined blocks of code for a few more cases (line ending with ',', etc...)",
        "4": "Added ai.tokens(), ai.advanced(), ai.query() in the msn2 ai class",
        "5": "Added chatgpt:instance class to lib/auto/chatgpt for more control over a ChatGPT model (demo in demos folder)",
        "6": "Updated the msn2 ai class model structure, and with a few more models (WIP)",
        "7": "Improved performance in raising errors",
        "8": "Improved performance in general interpretation. This includes simplifying potentially tight loops and common method executions such as argument parsing.",
        "9": "Repaired function insert(iterable, index, object)"
    },
    "2.0.401": {
        "1": "Added msn2cli.py for more control over executing .msn2 programs",
        "2": "Added JavaScript generation support (see tests/next_2.0.400/)",
        "3": "Added function: uuid4()"
    },
    "2.0.402": {
        "1": "Published VS Code extension 'msn2-syntax-highlighting' for .msn2 file extension syntax highlighting",
        "2": "Converted main function interpretation to a dispatch table, this should significantly improve performance in the long run",
        "3": "Fixed a bug involving MSN2 portable package generation",
        "4": "Fixed a bug involving '{python_alias} msn2cli.py int' to start the MSN2 interpreter",
        "5": "Fixed a bug involving the 'Getting Started' and 'Suggested Usage' help pages",
        "6": "Fixed a bug involving the CLI 'element' command",
        "7": "Removed CLI 'package' option",
        "8": "Removed CLI 'gpt' option"
    }
}